[Killed] Block removal mutation
SendOrder.cs:9:9
     public class SendOrder
     {
         public bool Send(int orderid, IEmail emailinfo)
-        {
-
-            if (orderid > 0)
-            {
-               emailinfo.subject = orderid.ToString();
-               return emailinfo.SendEmail();
-            }
-              
-            return false;
-        }
+        {}
 
     

[Killed] Equality mutation
SendOrder.cs:11:17
         public bool Send(int orderid, IEmail emailinfo)
         {
 
-            if (orderid > 0)
+            if (orderid < 0)
             {
                emailinfo.subject = orderid.ToString();

[Killed] Negate expression
SendOrder.cs:11:17
         public bool Send(int orderid, IEmail emailinfo)
         {
 
-            if (orderid > 0)
+            if (!(orderid > 0))
             {
                emailinfo.subject = orderid.ToString();

[Killed] Block removal mutation
SendOrder.cs:12:13
         {
 
             if (orderid > 0)
-            {
-               emailinfo.subject = orderid.ToString();
-               return emailinfo.SendEmail();
-            }
+            {}
               
             return false;
